Documents/ВводСведенийОНачисленияхРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводСведенийОНачисленияхРаботников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОНачисленияхСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеНачисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоваяРоль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияОНачисленияхСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОНачисленияхСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействияСНачислением</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПараметрНачисленияЗП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТрудоваяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеРоли</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействияСНачислением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействияСНачислением</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прекратить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекратитьСочетание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПараметровРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПараметровРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорияВыработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкаПоПрейскуранту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеТовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеТабеля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шкала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНачисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйПараметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПоказателиРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПоказателиРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Себестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаБезСкидок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаОплат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьПоПрайсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоДнейПоТабелю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧасовПоТабелю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаПродажАбонементов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейОтработаноПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовОтработаноПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДнейОтработаноСверхНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовОтработаноСверхНормы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПараметрыРасчетаЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПараметрыРасчетаЗП</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуетсяПриоритизацияУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеСписка</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводСведенийОНачисленияхРаботников/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем мТекущаяДатаДокумента Экспорт; // Хранит текущую дату документа - для проверки перехода документа в другой период
                                     // установки номера.
&НаКлиенте
Перем мТекущийСотрудник;

&НаКлиенте
Перем мВидРасчетаИзменился;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	// Заполним таблицу работников.
	ЗаполнитьТаблицуРаботниковОрганизации();
	
	Работники = ДанныеФормыВЗначение(РаботникиОрганизации, Тип("ТаблицаЗначений"));
	Работники.Индексы.Добавить("Сотрудник");
	
	ЗначениеВДанныеФормы(Работники, РаботникиОрганизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	мТекущаяДатаДокумента = Объект.Дата;
	
	// Кнопки "По сотруднику" командных панелей установим в оключенное состояние.
	Элементы.ГруппаНачисления.ПодчиненныеЭлементы.ОсновныеНачисления.КоманднаяПанель.ПодчиненныеЭлементы.ОсновныеНачисленияВсеРаботники.Пометка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВсеРаботники(Команда)
	
	Если Элементы.РаботникиОрганизации.ТекущиеДанные <> Неопределено
		И Элементы.РаботникиОрганизации.ТекущиеДанные.Сотрудник <> Неопределено Тогда
		
		Если Элементы.ОсновныеНачисления.ОтборСтрок <> Неопределено Тогда
			
			// Отключим отбор.
			Элементы.ГруппаНачисления.ПодчиненныеЭлементы.ОсновныеНачисления.КоманднаяПанель.ПодчиненныеЭлементы.ОсновныеНачисленияВсеРаботники.Пометка = Ложь;
			Элементы.ОсновныеНачисления.ОтборСтрок = Неопределено;
			Элементы.ОсновныеНачисления.Обновить();
			
		Иначе
			// Установим отбор.
			Элементы.ОсновныеНачисления.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", Элементы.РаботникиОрганизации.ТекущиеДанные.Сотрудник);
			Элементы.ГруппаНачисления.ПодчиненныеЭлементы.ОсновныеНачисления.КоманднаяПанель.ПодчиненныеЭлементы.ОсновныеНачисленияВсеРаботники.Пометка = Истина;
			
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице работников не выбрана строка!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьСведениямиПоСотрудникам(Команда)
	
	Если Объект.ОсновныеНачисления.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Продолжить?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
		
		Объект.ОсновныеНачисления.Очистить();
		
	КонецЕсли;
	
	Сотрудники = Новый Массив;
	Для Каждого Строка Из РаботникиОрганизации Цикл
		Сотрудники.Добавить(Строка.Сотрудник);
	КонецЦикла;
	
	ЗаполнитьСведениямиПоСотрудникамСервер(Сотрудники);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьСведениямиДляТекущего(Команда)
	
	Если Не Ждать ЗаполнитьСведениямиДляТекущего_ПредварительныеПроверки() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСведениямиПоСотрудникамСервер(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Элементы.РаботникиОрганизации.ТекущиеДанные.Сотрудник));
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьТекущегоЧужимиСведениями(Команда)
	
	Если Не Ждать ЗаполнитьСведениямиДляТекущего_ПредварительныеПроверки() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьТекущегоЧужимиСведениями_ПослеВыбора", ЭтотОбъект, Элементы.РаботникиОрганизации.ТекущиеДанные.Сотрудник);
	
	ПараметрыОткрытия = Новый Структура("Дата", Объект.Дата);
	ОткрытьФорму("Документ.ВводСведенийОНачисленияхРаботников.Форма.ПараметрыПолученияСхемыМотивации", ПараметрыОткрытия, ЭтотОбъект, ЭтотОбъект,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ЗаполнитьТекущегоЧужимиСведениями_ПослеВыбора(Результат, Сотрудник) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗаполнитьСведениямиПоСотрудникамСервер(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Результат.Сотрудник), Сотрудник, Результат.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ЗаполнитьСведениямиДляТекущего_ПредварительныеПроверки()
	
	ТекущиеДанные = Элементы.РаботникиОрганизации.ТекущиеДанные;
	Если Элементы.РаботникиОрганизации.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Сотрудник не выбран");
		Возврат Ложь;
	КонецЕсли;
	
	СтрокиТекущего = Объект.ОсновныеНачисления.НайтиСтроки(Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник));
	Если СтрокиТекущего.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='Перед заполнением текущие строки работника будут очищены. Продолжить?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		КонецЕсли; 
		
		Для Каждого СтрокаТекущего Из СтрокиТекущего Цикл
			Объект.ОсновныеНачисления.Удалить(СтрокаТекущего);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОбщимиСведениямиПоТрудовымРолям(Команда)
	
	ЗаполнитьОбщимиСведениямиПоТрудовымРолямСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборРаботника(Сотрудник)
	
	Если Элементы.ГруппаНачисления.ПодчиненныеЭлементы.ОсновныеНачисления.КоманднаяПанель.ПодчиненныеЭлементы.ОсновныеНачисленияВсеРаботники.Пометка Тогда
		Элементы.ОсновныеНачисления.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", Сотрудник);
    КонецЕсли;
	
КонецПроцедуры // УстановитьОтборРаботника().

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	РаботаСДиалогамиСервер.ПроверитьНомерДокумента(Объект, мТекущаяДатаДокумента);
	мТекущаяДатаДокумента = Объект.Дата;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРаботниковОрганизации()
	
	РаботникиОрганизации.Очистить();
	
	ТЗ = Объект.ОсновныеНачисления.Выгрузить();
	ТЗ.Свернуть("Сотрудник");
	ТЗ.Сортировать("Сотрудник");
	
	Для Каждого СтрокаТабличнойЧасти Из ТЗ Цикл
		ЗаполнитьЗначенияСвойств(РаботникиОрганизации.Добавить(), СтрокаТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуРаботниковОрганизации().

&НаКлиенте
Процедура РаботникиОрганизацииПриАктивизацииСтроки(Элемент)
	
	ДанныеСтроки = Элементы.РаботникиОрганизации.ТекущиеДанные;
	
	Если	ДанныеСтроки = Неопределено 
		Или ДанныеСтроки.Сотрудник = Неопределено 
	Тогда
		мТекущийСотрудник = Неопределено;
		Возврат;
	КонецЕсли;
	
	// Запомним текущего работника.
	мТекущийСотрудник	= ДанныеСтроки.Сотрудник;
	
	УстановитьОтборРаботника(ДанныеСтроки.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииПередУдалением(Элемент, Отказ)
	
	РаботникиОрганизацииПередУдалениемСервер(Элемент.ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура РаботникиОрганизацииПередУдалениемСервер(Сотрудник)
	
	Если РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)).Количество() = 1 Тогда
		Об = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ВводСведенийОНачисленияхРаботников"));
		Об.УдалитьСтрокиНачисленийПоРаботнику(Сотрудник);
		ЗначениеВДанныеФормы(Об, Объект);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура РаботникиОрганизацииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	// Если работник изменился, то по предыдущему работнику удалим строки, а по новому добавим.
	Если ДанныеСтроки.Сотрудник <> мТекущийСотрудник И
		РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", мТекущийСотрудник)).Количество() = 0
	Тогда
		РаботникиОрганизацииПередУдалениемСервер(мТекущийСотрудник);
		мТекущийСотрудник = ДанныеСтроки.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение)).Количество() = 0 Тогда
		
		РаботникиОрганизации.Добавить().Сотрудник = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Попытка
		УстановитьОтборРаботника(Элемент.ТекущиеДанные.Сотрудник);
	Исключение КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииСотрудникПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.РаботникиОрганизации.ТекущиеДанные;
	УстановитьОтборРаботника(ДанныеСтроки.Сотрудник);
		
КонецПроцедуры

// Обработка выбора сотрудника в таблице сотрудников, проверка на повторяющихся сотрудников.
&НаКлиенте
Процедура РаботникиОрганизацииСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокиРаботников = РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	
	Если СтрокиРаботников.Количество() > 0 И Элемент.Родитель.ТекущиеДанные.Сотрудник <> ВыбранноеЗначение Тогда
		ПоказатьПредупреждение(,"В данном документе по одному работнику можно вводить только одну строку!");
		Возврат;
	КонецЕсли;
	
	Элемент.Родитель.ТекущиеДанные.Сотрудник = ВыбранноеЗначение;
	
	УстановитьОтборРаботника(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		мсСтр = РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник));
		Если мсСтр.Количество() <> 0 Тогда
			Элементы.РаботникиОрганизации.ТекущаяСтрока = мсСтр[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ДанныеСтроки = Элемент.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		Если Элементы.ОсновныеНачисления.ОтборСтрок <> Неопределено И ЗначениеЗаполнено(Элементы.ОсновныеНачисления.ОтборСтрок.Сотрудник) Тогда
			ДанныеСтроки.Сотрудник = Элементы.ОсновныеНачисления.ОтборСтрок.Сотрудник;
			
		Иначе
			ДанныеСтрокиТЧРаботники = Элементы.РаботникиОрганизации.ТекущиеДанные;
			Если ДанныеСтрокиТЧРаботники <> Неопределено Тогда
				ДанныеСтроки.Сотрудник = ДанныеСтрокиТЧРаботники.Сотрудник;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеСтроки.Действие) Тогда
			ДанныеСтроки.Действие = ПредопределенноеЗначение("Перечисление.ВидыДействияСНачислением.Начать");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияПослеУдаления(Элемент)
	ЗаполнитьТаблицуРаботниковОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияСотрудникПриИзменении(Элемент)
	
	ОсновныеНачисленияСотрудникПриИзмененииСервер(Элементы.ОсновныеНачисления.ТекущиеДанные.Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура ОсновныеНачисленияСотрудникПриИзмененииСервер(Значение)
	
	Если РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник",Значение)).Количество() = 0 Тогда
		ЗаполнитьТаблицуРаботниковОрганизации();
	КонецЕсли;
	
КонецПроцедуры 	

&НаСервереБезКонтекста
Функция ПолучитьЗначенияПоказателей(ВидНачисленияСсылка)
	
	Показатели = Новый Структура;
	
	ВидНачисления = ВидНачисленияСсылка.ПолучитьОбъект();
	пчВидыПараметровРасчета = Перечисления.ВидыПараметровРасчетаНачислений;
	
	Для ТекПараметр = 1 По 3 Цикл
		
		ВидПараметра = ВидНачисления["ВидПараметра"+ТекПараметр];
		
		Если ВидПараметра = пчВидыПараметровРасчета.КатегорияВыработки Тогда
			Значение = Справочники.КатегорииВыработки.ПустаяСсылка();
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.ДанныеТабеля Тогда
			ПоказательНачисления = ВидНачисления["ПоказательРасчета"+ТекПараметр];
			Если ПоказательНачисления = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю
				Или ПоказательНачисления = Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю
			Тогда
				Значение = Неопределено;
			Иначе
				Значение = Справочники.ВидыГрафиков.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.Число Тогда
			Значение = 0;
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.Шкала Тогда
			Значение = Справочники.ШкалыРасчета.ПустаяСсылка();
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.ВидНачисления Тогда
			Значение = ПланыВидовРасчета.Начисления.ПустаяСсылка();
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.Ответственный Тогда
			Значение = Справочники.Пользователи.ПустаяСсылка();
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.Филиал Тогда
			Если ПроцедурыСпециализацииПоставки.ПоддерживаетсяУчетПоНесколькимФилиалам() Тогда
				Значение = Справочники.Филиалы.ПустаяСсылка();
			Иначе
				Значение = Неопределено;
			КонецЕсли;
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.ОценкаПоПрейскуранту Тогда
			Значение = Справочники.Прейскуранты.ПустаяСсылка();
		ИначеЕсли ВидПараметра = пчВидыПараметровРасчета.ДополнительныйПараметр Тогда
			Значение = Справочники.ПараметрыРасчетаЗП.ПустаяСсылка();
		Иначе
			Значение = Неопределено;
		КонецЕсли;
		
		Показатели.Вставить("Показатель" + ТекПараметр, Значение);
		
	КонецЦикла;
	
	Возврат Показатели;
	
КонецФункции

&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
	
	ОсновныеНачисленияВидРасчетаПриИзмененииПереопред(Элемент, Элементы.ОсновныеНачисления.ТекущиеДанные.ВидРасчета, мВидРасчетаИзменился) 
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	мВидРасчетаИзменился = Элемент.Родитель.ТекущиеДанные.ВидРасчета <> ВыбранноеЗначение; 
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаПриИзмененииПереопред(Элемент, ВидНачисления, ИзменятьЗначение = Истина)
	
	Если ЗначениеЗаполнено(ВидНачисления) Тогда
		Показатели = ПолучитьЗначенияПоказателей(ВидНачисления);
		
		Для ТекПараметр = 1 По 3 Цикл
			
			Если ИзменятьЗначение Тогда
				ЗначениеПоУмолчанию = Показатели["Показатель" + ТекПараметр];
				Если ТипЗнч(Элементы.ОсновныеНачисления.ТекущиеДанные["Показатель"+ТекПараметр]) <> ТипЗнч(ЗначениеПоУмолчанию) Тогда
					Элементы.ОсновныеНачисления.ТекущиеДанные["Показатель"+ТекПараметр] = ЗначениеПоУмолчанию;
				КонецЕсли;
			КонецЕсли;		
			
			Если Показатели["Показатель" + ТекПараметр] = Неопределено Тогда
				Элементы["ОсновныеНачисленияПоказатель"+ ТекПараметр].Доступность = Ложь;
			Иначе
				Элементы["ОсновныеНачисленияПоказатель"+ ТекПараметр].Доступность = Истина;
			КонецЕсли;	
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСведениямиПоСотрудникамСервер(Сотрудники, Получатель = Неопределено, Дата = Неопределено)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = Объект.Дата;
	КонецЕсли;
	
	ТаблицаНачислений = РасчетЗаработнойПлаты.ПолучитьСхемыЗП(Сотрудники, Дата, Дата, Истина);
	ТаблицаНачислений.Колонки.Параметр1.Имя = "Показатель1";
	ТаблицаНачислений.Колонки.Параметр2.Имя = "Показатель2";
	ТаблицаНачислений.Колонки.Параметр3.Имя = "Показатель3";
	ТаблицаНачислений.Колонки.Начисление.Имя = "ВидРасчета";

	Для Каждого Строка Из ТаблицаНачислений Цикл
		СтрокаНачисления = Объект.ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачисления, Строка);
		СтрокаНачисления.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять;
		Если Получатель <> Неопределено Тогда
			СтрокаНачисления.Сотрудник = Получатель;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщимиСведениямиПоТрудовымРолямСервер()
	
	мОбрИнд = Объект.ОсновныеНачисления.Количество()-1;
	Для сч = 0 По мОбрИнд Цикл
		
		СтрокаТЗ = Объект.ОсновныеНачисления[мОбрИнд-сч];
		Если Не ЗначениеЗаполнено(СтрокаТЗ.Сотрудник)
			И ЗначениеЗаполнено(СтрокаТЗ.ТрудоваяРоль)
		Тогда
			Объект.ОсновныеНачисления.Удалить(мОбрИнд-сч);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.Начисление КАК ВидРасчета,
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.Параметр1 КАК Показатель1,
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.Параметр2 КАК Показатель2,
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.Параметр3 КАК Показатель3,
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.ТрудоваяРоль,
	               |	СведенияОНачисленияхСотрудниковСрезПоследних.Действие
	               |ИЗ
	               |	РегистрСведений.СведенияОНачисленияхСотрудников.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |				И Действие <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)) КАК СведенияОНачисленияхСотрудниковСрезПоследних";
				   
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(Объект.ОсновныеНачисления.Добавить(),Выборка);		
	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
